Feature: Редактиране съществуваща резервация от зъболекаря или служител на рецепция.

  Scenario Outline:Редактиране на съществуваща резервация
    Given Отваряме екрана за редактиране на час
    When Редактираме резервацията с нова дата: "<new_date>"
    And Редактираме резервацията с нов час: "<new_time>"
    And Редактираме резервацията с ново име: "<new_name>"
    And Редактираме резервацията с нова услуга: "<new_treatment>"
    And Натискаме бутона за редактиране
    Then Виждаме съобщение:"<expectedMessage>"

    Examples:
      | new_date   | new_time | new_name | new_treatment        | expectedMessage                               |
      | 2023-06-09 | 15:30 PM | Petar    | Почистване           | Резервацията е успешно редактирана            |
      | 2023-06-07 | 15:30 PM |          | Полиране + Избелване | Въведените данни са невалидни                 |
      | 2022-01-01 |          | Angel | Полиране + Избелване | Моля,избере удобен за вас час!                |
      | 2023-06-04 | 16:30 PM | Mariq    |                      | Изберете услуга                               |
      | 2023-06-07 | 15:30 PM | Mariq    | Полиране + Избелване | Зает час!                                     |
      | 2023-06-02 | 20:00 PM | Marian    | Полиране + Избелване | Не може да бъде редактиран несъществуващ час. |
