Feature: Резервация без регистрация

  Scenario Outline:Запазване на час без регистрация
    Given Отваряме екрана за запазване на час
    When Избираме дата от календара:"<date>"
    And Избираме час от календара:"<time>"
    And Въвеждаме име: "<name>"
    And Избираме услуга: "<treatment>"
    And Въвеждаме тел.номер: "<phone>"
    And Натискаме бутона за запазване на час
    Then Виждаме съобщение:"<expectedMessage>"

    Examples:
      | date       | time     | name   | treatment        | phone       | expectedMessage                  |
      | 2023-05-19 | 14:00 PM | ivan3  | Първичен преглед | 0887448898  | Успешно запазихте своя час!      |
      | 2023-05-25 |          | ivan   | Първичен преглед | 0897584367  | Моля,избере удобен за вас час!   |
      | 2023-05-15 | 11:00 AM |        | Първичен преглед | 08778748329 | Въведете име!                    |
      | 2023-05-15 | 11:00 AM | petar  | Първичен преглед | 0877448329  | Зает час!Моля изберете друг!     |
      | 2023-05-12 | 10:00 AM | ivan   |                  | 0889679921  | Изберете причина за посещението! |
      | 2023-05-15 | 10:00 AM | ivan   | Първичен преглед |             | Моля,въведете телефонен номер!   |
      | 2023-05-15 | 10:00 AM | ivan   | Първичен преглед | 67!989      | Невалиден телефонен номер!       |












